# Space_FullyReset

## Description
Allow a full rest of the Space obj, including Boundary

```pascal
PROCEDURE Space_FullyReset(space : HANDLE);
```

```python

def vs.Space_FullyReset(space):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|space|HANDLE||

## Version
Availability: from Vectorworks 2024
## Category
* SpaceObjectCoreTools